Documents/РасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>РасходнаяНакладная</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<RegisterRecords>
				<xr:Item>InformationRegister.франПрограммныеПродуктыКонтрагентов</xr:Item>
				<xr:Item>InformationRegister.прНапоминанияОПродажах</xr:Item>
				<xr:Item>AccumulationRegister.пр_НачисленныеБаллы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТУ_статус</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ТУ_ВидыСтатусовПодписанияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСделка</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.франПериоды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франАвтор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франВидРеализации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.франВидРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франДатаСдачи</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франЗаявкаНаПодпискуИТС</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:DocumentRef.франЗаявкаНаПодпискуИТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франРучноеРаспределениеЛУРВ</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франСдан</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>франСозданОбработкой</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторИС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Предоплата</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерийныеНомера</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СерийныйНомер</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.СерийныеНомера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСвязи</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/РасходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура пр_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	пр_УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура пр_УправлениеЭлементамиФормы()
	
	#Область Заказ
	
	// Переопределения поля с заказом
	Элементы.Заказ.Видимость = Ложь;
	
	// Добавление поля вместо заказа
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтаФорма, Элементы.ГруппаЗаказОснование, Элементы.Заказ);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.Заказ");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Заказ");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "ЗаказПериод");
	ПолеФормы.МаксимальнаяШирина 		= 36;
	ПолеФормы.АвтоМаксимальнаяШирина 	= Ложь;
	
	#КонецОбласти 
	
	#Область РеквизитыПР
	
	// Группа ПР
	КонтекстГруппы = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, Элементы.ДополнительноЛеваяКолонка);
	КонтекстГруппы.Свойства.Вставить("Заголовок", "Простые решения");
	КонтекстГруппы.Свойства.Вставить("ОтображатьЗаголовок", Истина);
 	ГруппаРеквизитыПР = РедакторФорм.ДобавитьГруппуОбычную(КонтекстГруппы, "ГруппаПростыеРешения");
	
	// франДатаСдачи
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франДатаСдачи");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Дата сдачи");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франДатаСдачи");
	
	// франСдан
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франСдан");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Сдан");
	КонтекстПоля.Свойства.Вставить("Вид", 			ВидПоляФормы.ПолеФлажка);
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франСдан");
	
	// франАвтор
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франАвтор");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Автор (франчайзи)");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франАвтор");
	
	// франВидРеализации
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франВидРеализации");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Вид реализации");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франВидРеализации");
	
	// франЗаявкаНаПодпискуИТС
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.франЗаявкаНаПодпискуИТС");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Заявка на подписку ИТС");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "франЗаявкаНаПодпискуИТС");
	
	// ТУ_статус
	КонтекстПоля = РедакторФорм.СоздатьКонтекстЭлемента(ЭтотОбъект, ГруппаРеквизитыПР, ГруппаРеквизитыПР);	
	КонтекстПоля.Свойства.Вставить("ПутьКДанным", 	"Объект.ТУ_статус");
	КонтекстПоля.Свойства.Вставить("Заголовок", 	"Статус");
	ПолеФормы = РедакторФорм.ДобавитьПолеНаФорму(КонтекстПоля, "ТУ_статус");
	
	#КонецОбласти 
	
	#Область РеквизитыУправленческогоУчета
	
	// Переход с УПП
	пр_РаботаСФормами.пр_ДобавитьФлажкиПринадлежностиУчетовНаФорму(ЭтаФорма, Элементы.ДополнительноЛеваяКолонка);
	
	#КонецОбласти 
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция пр_ВидДоговораПоПериодам(Договор)
	
	Возврат Справочники.ДоговорыКонтрагентов.пр_ВидДоговораПоПериодам(Договор);
	
КонецФункции

#КонецОбласти
